export const cryptoMessage = {
    buttons: {
        encrypt: '🔒 Зашифрувати',
        decrypt: '🔓 Розшифрувати',
        cancel: '🚫 Скасувати',
    },
    commands: {
        cancel: '/cancel',
    },
    text: {
        start: 'Ця команда допоможе зашифрувати або розшифрувати ваші дані.\n<i>Дані можна розшифрувати лише в тому випадку, якщо вони були зашифровані цим самим ботом.</i>\n\n⚠️ Для забезпечення безпеки ваших даних утримуйтеся від використання цієї функції, коли ваш пристрій підключений до публічної Wi-Fi мережі.\nКрім того, бот автоматично видалятиме повідомлення, яке було зашифроване або розшифроване, через 1 хвилину після відправлення. Зберігайте початкові дані у безпечному місці!\n\nВиберіть дію:',
        encrypt:
            "Щоб зашифрувати дані, вам необхідно вказати пароль, який буде використовуватися як ключ для шифрування.\n<b>Цей пароль слід запам'ятати, оскільки він буде потрібен для подальшого розшифрування даних.</b>\n\nВведіть пароль для початку процесу шифрування:",
        decrypt:
            'Щоб розшифрувати дані, вам необхідно вказати пароль, який був використаний для шифрування.\n\nВведіть пароль для початку процесу розшифрування:',
        nextStepAfterPassEncrypt:
            '🔐 Ваш пароль було видалено з чату задля безпеки.\n\nНаступний крок:\nНадішліть файл з розширенням <code>.txt</code> або надішліть повідомлення яке хочете зашифрувати.',
        repeatNextStepAfterPassEncrypt:
            'Надішліть файл з розширенням <code>.txt</code> або надішліть повідомлення яке хочете зашифрувати.',
        nextStepAfterPassDecrypt:
            '🔐 Ваш пароль було видалено з чату задля безпеки.\n\nНаступний крок:\nНадішліть файл з розширенням <code>.json</code> який раніше був згенерований цим ботом.',
        repeatNextStepAfterPassDecrypt:
            'Надішліть файл з розширенням <code>.json</code> який раніше був згенерований цим ботом.',
        cancel: 'Ви вийшли з режиму криптографії.',
        encrypting: '🔒 Шифрування...',
        decrypting: '🔒 Розшифрування...',
        ecnrypted: '🔒 Зашифровано!',
        decrypted: '🔓 Розшифровано!',
        remove: '⚠️ Повідомлення буде видалено через 1 хвилину, збережіть зашифровані дані в безпечному місці!\n\n<i>Не залишайте файли в завантаженнях телеграму!</i>',
        removed: 'Повідомлення було видалено!',
        error: '🚫 Помилка! Спробуйте ще раз або відмініть операцію.',
        wrongPassword: '🚫 Неправильний пароль!',
        wrongType: '🚫 Неправильний тип файлу!',
    },
};
